[
  {
    "name": "Блокчейн",
    "content": "Блокчейн – выстроенная по определённым правилам непрерывная\nпоследовательная цепочка блоков (связный список), содержащих какую-либо\nинформацию. Связь между блоками обеспечивается не только нумерацией, но\nи тем, что каждый блок содержит свою собственную хеш-сумму и хеш-сумму\nпредыдущего блока. Изменение любой информации в блоке изменит его хеш-\nсумму. Чтобы соответствовать правилам построения цепочки, изменения хеш-\nсуммы нужно будет записать в следующий блок, что вызовет изменения уже\nего собственной хеш-суммы. При этом предыдущие блоки не затрагиваются.\nЕсли изменяемый блок последний в цепочке, то внесение изменений может не\nпотребовать существенных усилий. Но если после изменяемого блока уже\nсформировано продолжение, то изменение может оказаться крайне\nтрудоёмким процессом. Дело в том, что обычно копии цепочек блоков\nхранятся на множестве разных компьютеров независимо друг от друга "
  },
  {
    "name": "Хэш сумма",
    "content": "Хеш-сумма – результат обработки данных хеш-функцией. В\nкриптографии хеш-сумму используют как подпись сообщения"
  },
  {
    "name": "Хэш функция",
    "content": "Хеш-функция – функция, осуществляющая преобразование массива\nвходных данных произвольной длины в выходную битовую строку\nустановленной длины, выполняемое определённым алгоритмом"
  },
  {
    "name": "Майнинг",
    "content": "Майнинг – деятельность по созданию новых структур (новые\nблоки в блокчейне) для обеспечения функционирования криптовалютных\nплатформ. За создание очередной структурной единицы обычно\nпредусмотрено вознаграждение за счёт новых (эмитированных) единиц\nкриптовалюты и/или комиссионных сборов. Обычно майнинг сводится к\nсерии вычислений с перебором параметров для нахождения хеша с заданными\nсвойствами. Разные криптовалюты используют разные модели вычислений, но\nони всегда достаточно длительны по времени для нахождения приемлемого\nварианта и быстры для проверки найденного решения. Такие вычисления\nиспользуются алгоритмами криптовалют для обеспечения защиты от\nповторного расходования одних и тех же единиц, а вознаграждение\nстимулирует людей расходовать свои вычислительные мощности и\nподдерживать работу сетей"
  },
  {
    "name": "Криптовалюты",
    "content": "Криптовалюта – разновидность цифровой валюты, учёт внутренних\nрасчётных единиц которой обеспечивает децентрализованная платёжная\nсистема (нет внутреннего или внешнего администратора или какого-либо его\nаналога), работающая в полностью автоматическом режиме. Сама по себе\nкриптовалюта не имеет какой-либо особой материальной или электронной\nформы — это просто число, обозначающее количество данных расчётных\nединиц, которое записывается в соответствующей позиции информационного\n7\nпакета протокола передачи данных и зачастую даже не подвергается\nшифрованию, как и вся иная информация о транзакциях между адресами\nсистемы"
  },
  {
    "name": "Закрытый ключ",
    "content": "Закрытый ключ – ключ из ключевой пары, сохраняемый в секрете.\nОткрытый ключ доступен всем желающим. Фокус состоит в том, что при этом\nкриптосистема не подвергается опасности. Закрытый ключ хранится в тайне и\nизвестен только одной стороне обмена информацией. Ключи из пары связаны\nматематически, причем так, что, зная открытый ключ, вычислить закрытый на\nпрактике за разумное время невозможно  "
  },
  {
    "name": "Открытый ключ",
    "content": "Открытый ключ – это криптографический ключ, используемый в\nасимметричной криптографической системе; каждый открытый ключ связан с\nзакрытым ключом. Особенностью асимметричных криптосистем является то,\nчто каждая пара ключей формируется таким образом, что то, что зашифровано\nодним, может быть расшифровано только другим"
  },
  {
    "name": "Смарт контракт",
    "content": "Смарт-контракт – компьютерный алгоритм, предназначенный для\nформирования, управления и предоставления информации о владении чем-\nлибо"
  },
  {
    "name": "EVM",
    "content": "EVM - это вычислительный механизм и программная платформа,функционирующая как децентрализованный компьютер. Разработчики используют виртуальную машину Ethereum для создания DApps на базе Ethereum и совместимого с EVM языка программирования Solidity - от криптоприложений DeFi и EVM до игр и торговых площадок, таких как OpenSea"
  },
  {
    "name": "Gas",
    "content": "Gas – это топливо, на котором работает виртуальная машина\nEthereum. Переводите ли вы криптовалюту EVM или инвестируете в NFT, газ\nнеобходим для оплаты выполнения операции. Газ выступает в качестве платы\nза вычисления, необходимые для выполнения смарт-контрактов"
  },
  {
    "name": "Solidity",
    "content": "Solidity – объектно-ориентированный, предметно-ориентированный\nязык программирования самовыполняющихся контрактов для платформы\nEthereum "
  },
  {
    "name": "Транзакция",
    "content": "Транзакция – операция сохранения данных в блокчейне, в ходе\nкоторой происходит передача криптоактивов или другой информации между\nкошельками. Отправка транзакции происходит после её создания в кошельке\nи подписания цифровой подписью на основе закрытого ключа"
  },
  {
    "name": "Gwei",
    "content": "Gwei – это номинал эфира (ETH), криптовалюты, которая\nиспользуется для оплаты товаров и услуг в блокчейне Ethereum. Gwei равен\n1,000,000,000 Wei, что является наименьшим возможным номиналом ETH\n(точно так же, как центы относятся к долларам или сатоши к биткоину). Гвей\nв расшифровке означает гигавэй. Gwei – это наиболее часто используемый\nноминал эфира. В основном он используется в наименовании газа в сети\nEthereum"
  },
  {
    "name": "Whitepaper",
    "content": "Whitepaper – публичный документ, который раскрывает основную\nинформацию о проекте в рамках проведения ICO: количество выпускаемых\nтокенов, цель и временные рамки проведения ICO, команда, дорожная карта\nпроекта, его особенности, технические детали и иное"
  },
  {
    "name": "Майнер",
    "content": "Майнер – пользователи криптовалютной сети, которые используют\nспециализированное оборудование, называемое ASIC, чтобы обрабатывать\nтранзакций в сети и получать вознаграждения за майнинг в виде\nкриптовалюты. Они отвечают за проверку транзакций, создание новых блоков\nи добавление их в блокчейн"
  }
]